// -----// IR Dump Before LinalgLowerToAffineLoops (convert-linalg-to-affine-loops) //----- //
#map = affine_map<(d0, d1)[s0, s1] -> (d0 * s1 + s0 + d1)>
module {
  func.func @conv2d_kernel_0d1234c567c8d91011de12de1314c15d16d17e18e19de20de21e22c23c24c25c26c27c28c29c(%arg0: i64, %arg1: i32, %arg2: i32, %arg3: i32, %arg4: i32, %arg5: i32, %arg6: i64, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32, %arg11: i32, %arg12: i64, %arg13: i64, %arg14: i32, %arg15: i32, %arg16: i32, %arg17: i32, %arg18: i32) attributes {llvm.emit_c_interface} {
    %false = arith.constant false
    %c1 = arith.constant 1 : index
    %c4 = arith.constant 4 : index
    %c0 = arith.constant 0 : index
    %c4_i64 = arith.constant 4 : i64
    %true = arith.constant true
    %c1_i32 = arith.constant 1 : i32
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0.000000e+00 : f32
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = tensor.empty() : tensor<1x4xi1>
    %2 = linalg.fill ins(%true : i1) outs(%1 : tensor<1x4xi1>) -> tensor<1x4xi1>
    %3 = tensor.empty() : tensor<4x1xi1>
    %4 = linalg.fill ins(%true : i1) outs(%3 : tensor<4x1xi1>) -> tensor<4x1xi1>
    %c8 = arith.constant 8 : index
    scf.for %arg19 = %c0 to %c8 step %c1 {
      %5 = arith.index_cast %arg19 : index to i32
      %6 = arith.extsi %5 : i32 to i64
      %7 = arith.muli %6, %c4_i64 : i64
      %8 = arith.addi %arg12, %7 : i64
      %9 = llvm.inttoptr %8 : i64 to !llvm.ptr
      %view_memref = aux.view %9 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
      %10 = memref.load %view_memref[%c0] : memref<1xf32>
      %11 = arith.muli %5, %arg16 : i32
      %12 = arith.muli %5, %arg17 : i32
      %13 = arith.muli %5, %arg18 : i32
      %14 = tensor.empty() : tensor<4xi32>
      %15 = scf.for %arg20 = %c0 to %c4 step %c1 iter_args(%arg21 = %14) -> (tensor<4xi32>) {
        %64 = arith.index_cast %arg20 : index to i32
        %inserted = tensor.insert %64 into %arg21[%arg20] : tensor<4xi32>
        scf.yield %inserted : tensor<4xi32>
      }
      %16 = arith.subi %5, %c1_i32 : i32
      %17 = linalg.fill ins(%16 : i32) outs(%14 : tensor<4xi32>) -> tensor<4xi32>
      %mapped = linalg.map { arith.addi } ins(%17, %15 : tensor<4xi32>, tensor<4xi32>) outs(%14 : tensor<4xi32>)
      %expanded = tensor.expand_shape %mapped [[0, 1]] : tensor<4xi32> into tensor<4x1xi32>
      %18 = arith.index_cast %16 : i32 to index
      %19 = arith.addi %18, %c4 : index
      %20 = arith.maxsi %18, %c0 : index
      %21 = arith.minsi %19, %20 : index
      %22 = arith.subi %21, %18 : index
      %23 = tensor.empty(%22) : tensor<?x1xi1>
      %24 = linalg.fill ins(%true : i1) outs(%23 : tensor<?x1xi1>) -> tensor<?x1xi1>
      %25 = linalg.fill ins(%false : i1) outs(%3 : tensor<4x1xi1>) -> tensor<4x1xi1>
      %inserted_slice = tensor.insert_slice %24 into %25[0, 0] [%22, 1] [1, 1] : tensor<?x1xi1> into tensor<4x1xi1>
      %mapped_0 = linalg.map { arith.xori } ins(%inserted_slice, %4 : tensor<4x1xi1>, tensor<4x1xi1>) outs(%3 : tensor<4x1xi1>)
      %26 = arith.index_cast %arg4 : i32 to index
      %27 = arith.maxsi %26, %18 : index
      %28 = arith.minsi %19, %27 : index
      %29 = arith.subi %28, %18 : index
      %30 = tensor.empty(%29) : tensor<?x1xi1>
      %31 = linalg.fill ins(%true : i1) outs(%30 : tensor<?x1xi1>) -> tensor<?x1xi1>
      %inserted_slice_1 = tensor.insert_slice %31 into %25[0, 0] [%29, 1] [1, 1] : tensor<?x1xi1> into tensor<4x1xi1>
      %mapped_2 = linalg.map { arith.andi } ins(%inserted_slice_1, %mapped_0 : tensor<4x1xi1>, tensor<4x1xi1>) outs(%3 : tensor<4x1xi1>)
      %32 = tensor.empty() : tensor<4x1xi32>
      %33 = linalg.fill ins(%arg3 : i32) outs(%32 : tensor<4x1xi32>) -> tensor<4x1xi32>
      %mapped_3 = linalg.map { arith.muli } ins(%expanded, %33 : tensor<4x1xi32>, tensor<4x1xi32>) outs(%32 : tensor<4x1xi32>)
      %collapsed = tensor.collapse_shape %mapped_2 [[0, 1]] : tensor<4x1xi1> into tensor<4xi1>
      %34 = tensor.empty() : tensor<4x4xi1>
      %broadcasted = linalg.broadcast ins(%collapsed : tensor<4xi1>) outs(%34 : tensor<4x4xi1>) dimensions = [1] 
      %35 = arith.muli %5, %arg2 : i32
      %collapsed_4 = tensor.collapse_shape %mapped_3 [[0, 1]] : tensor<4x1xi32> into tensor<4xi32>
      %36 = tensor.empty() : tensor<4x4xi32>
      %broadcasted_5 = linalg.broadcast ins(%collapsed_4 : tensor<4xi32>) outs(%36 : tensor<4x4xi32>) dimensions = [1] 
      %37 = arith.muli %5, %arg9 : i32
      %38 = arith.muli %5, %arg10 : i32
      %39 = arith.addi %38, %37 : i32
      %40 = arith.index_cast %arg5 : i32 to index
      %41 = llvm.inttoptr %arg0 : i64 to !llvm.ptr
      %collapsed_6 = tensor.collapse_shape %0 [[0, 1]] : tensor<4x4xf32> into tensor<16xf32>
      %expanded_7 = tensor.expand_shape %collapsed_6 [[0, 1]] : tensor<16xf32> into tensor<16x1xf32>
      %42 = arith.index_cast %arg7 : i32 to index
      %43 = arith.maxsi %42, %c0 : index
      %44 = arith.minsi %43, %c4 : index
      %45 = arith.index_cast %arg8 : i32 to index
      %46 = arith.maxsi %45, %c0 : index
      %47 = arith.minsi %46, %c4 : index
      %48 = arith.minsi %44, %c4 : index
      %49 = arith.maxsi %48, %c0 : index
      %50 = arith.minsi %47, %c4 : index
      %51 = arith.maxsi %50, %c0 : index
      %extracted = tensor.extract %15[%c0] : tensor<4xi32>
      %52 = arith.muli %extracted, %arg11 : i32
      %53 = arith.addi %extracted, %52 : i32
      %54 = arith.addi %53, %39 : i32
      %extracted_8 = tensor.extract %15[%c1] : tensor<4xi32>
      %55 = arith.muli %extracted_8, %arg11 : i32
      %56 = arith.addi %extracted, %55 : i32
      %57 = arith.addi %56, %39 : i32
      %58 = arith.subi %57, %54 : i32
      %59 = arith.index_cast %58 : i32 to index
      %60 = arith.index_cast %54 : i32 to index
      %61 = llvm.inttoptr %arg6 : i64 to !llvm.ptr
      %62 = tensor.empty(%49, %51) : tensor<?x?xf32>
      %63 = tensor.empty() : tensor<f32>
      scf.for %arg20 = %c0_i32 to %arg15 step %c1_i32  : i32 {
        %64 = arith.subi %arg20, %c1_i32 : i32
        %65 = linalg.fill ins(%64 : i32) outs(%14 : tensor<4xi32>) -> tensor<4xi32>
        %mapped_9 = linalg.map { arith.addi } ins(%65, %15 : tensor<4xi32>, tensor<4xi32>) outs(%14 : tensor<4xi32>)
        %66 = arith.index_cast %64 : i32 to index
        %67 = arith.addi %66, %c4 : index
        %68 = arith.maxsi %66, %c0 : index
        %69 = arith.minsi %67, %68 : index
        %70 = arith.subi %69, %66 : index
        %71 = tensor.empty(%70) : tensor<1x?xi1>
        %72 = linalg.fill ins(%true : i1) outs(%71 : tensor<1x?xi1>) -> tensor<1x?xi1>
        %73 = linalg.fill ins(%false : i1) outs(%1 : tensor<1x4xi1>) -> tensor<1x4xi1>
        %inserted_slice_10 = tensor.insert_slice %72 into %73[0, 0] [1, %70] [1, 1] : tensor<1x?xi1> into tensor<1x4xi1>
        %mapped_11 = linalg.map { arith.xori } ins(%inserted_slice_10, %2 : tensor<1x4xi1>, tensor<1x4xi1>) outs(%1 : tensor<1x4xi1>)
        %74 = arith.maxsi %40, %66 : index
        %75 = arith.minsi %67, %74 : index
        %76 = arith.subi %75, %66 : index
        %77 = tensor.empty(%76) : tensor<1x?xi1>
        %78 = linalg.fill ins(%true : i1) outs(%77 : tensor<1x?xi1>) -> tensor<1x?xi1>
        %inserted_slice_12 = tensor.insert_slice %78 into %73[0, 0] [1, %76] [1, 1] : tensor<1x?xi1> into tensor<1x4xi1>
        %mapped_13 = linalg.map { arith.andi } ins(%inserted_slice_12, %mapped_11 : tensor<1x4xi1>, tensor<1x4xi1>) outs(%1 : tensor<1x4xi1>)
        %collapsed_14 = tensor.collapse_shape %mapped_13 [[0, 1]] : tensor<1x4xi1> into tensor<4xi1>
        %broadcasted_15 = linalg.broadcast ins(%collapsed_14 : tensor<4xi1>) outs(%34 : tensor<4x4xi1>) dimensions = [0] 
        %mapped_16 = linalg.map { arith.andi } ins(%broadcasted, %broadcasted_15 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%34 : tensor<4x4xi1>)
        %broadcasted_17 = linalg.broadcast ins(%mapped_9 : tensor<4xi32>) outs(%36 : tensor<4x4xi32>) dimensions = [0] 
        %mapped_18 = linalg.map { arith.addi } ins(%broadcasted_17, %broadcasted_5 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%36 : tensor<4x4xi32>)
        %79 = linalg.fill ins(%35 : i32) outs(%36 : tensor<4x4xi32>) -> tensor<4x4xi32>
        %mapped_19 = linalg.map { arith.addi } ins(%mapped_18, %79 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%36 : tensor<4x4xi32>)
        %view_memref_20 = aux.view %41 to offset: [0], sizes: [9223372036854775807], strides: [1] : !llvm.ptr to memref<9223372036854775807xf32>
        %80 = bufferization.to_tensor %view_memref_20 restrict writable : memref<9223372036854775807xf32>
        %81 = linalg.fill ins(%cst : f32) outs(%expanded_7 : tensor<16x1xf32>) -> tensor<16x1xf32>
        %collapsed_21 = tensor.collapse_shape %mapped_19 [[0, 1]] : tensor<4x4xi32> into tensor<16xi32>
        %expanded_22 = tensor.expand_shape %collapsed_21 [[0, 1]] : tensor<16xi32> into tensor<16x1xi32>
        %collapsed_23 = tensor.collapse_shape %mapped_16 [[0, 1]] : tensor<4x4xi1> into tensor<16xi1>
        %dim = tensor.dim %expanded_22, %c0 : tensor<16x1xi32>
        %82 = scf.for %arg21 = %c0 to %dim step %c1 iter_args(%arg22 = %81) -> (tensor<16x1xf32>) {
          %extracted_32 = tensor.extract %collapsed_23[%arg21] : tensor<16xi1>
          %96 = scf.if %extracted_32 -> (tensor<16x1xf32>) {
            %extracted_33 = tensor.extract %expanded_22[%arg21, %c0] : tensor<16x1xi32>
            %97 = arith.index_cast %extracted_33 : i32 to index
            %extracted_34 = tensor.extract %80[%97] : tensor<9223372036854775807xf32>
            %inserted = tensor.insert %extracted_34 into %arg22[%arg21, %c0] : tensor<16x1xf32>
            scf.yield %inserted : tensor<16x1xf32>
          } else {
            scf.yield %arg22 : tensor<16x1xf32>
          }
          scf.yield %96 : tensor<16x1xf32>
        }
        %collapsed_24 = tensor.collapse_shape %82 [[0, 1]] : tensor<16x1xf32> into tensor<16xf32>
        %expanded_25 = tensor.expand_shape %collapsed_24 [[0, 1]] : tensor<16xf32> into tensor<4x4xf32>
        %view_memref_26 = aux.view %61 to offset: [%60], sizes: [%49, %51], strides: [%59, 1] : !llvm.ptr to memref<?x?xf32, #map>
        %83 = bufferization.to_tensor %view_memref_26 restrict writable : memref<?x?xf32, #map>
        %84 = linalg.copy ins(%83 : tensor<?x?xf32>) outs(%62 : tensor<?x?xf32>) -> tensor<?x?xf32>
        %85 = linalg.fill ins(%cst : f32) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
        %inserted_slice_27 = tensor.insert_slice %84 into %85[0, 0] [%49, %51] [1, 1] : tensor<?x?xf32> into tensor<4x4xf32>
        %mapped_28 = linalg.map { arith.mulf } ins(%expanded_25, %inserted_slice_27 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>)
        %collapsed_29 = tensor.collapse_shape %mapped_28 [[0, 1]] : tensor<4x4xf32> into tensor<16xf32>
        %86 = linalg.fill ins(%cst : f32) outs(%63 : tensor<f32>) -> tensor<f32>
        %reduced = linalg.reduce ins(%collapsed_29 : tensor<16xf32>) outs(%86 : tensor<f32>) dimensions = [0] 
          (%in: f32, %init: f32) {
            %96 = arith.addf %in, %init : f32
            linalg.yield %96 : f32
          }
        %extracted_30 = tensor.extract %reduced[] : tensor<f32>
        %87 = arith.addf %extracted_30, %cst : f32
        %88 = arith.addi %arg20, %13 : i32
        %89 = arith.addi %88, %12 : i32
        %90 = arith.addi %89, %11 : i32
        %91 = arith.extsi %90 : i32 to i64
        %92 = arith.muli %91, %c4_i64 : i64
        %93 = arith.addi %arg13, %92 : i64
        %94 = arith.addf %87, %10 : f32
        %95 = llvm.inttoptr %93 : i64 to !llvm.ptr
        %view_memref_31 = aux.view %95 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
        memref.store %94, %view_memref_31[%c0] : memref<1xf32>
      }
    }
    return
  }
}


// -----// IR Dump Before EmptyTensorToAllocTensor (empty-tensor-to-alloc-tensor) //----- //
#map = affine_map<(d0, d1)[s0, s1] -> (d0 * s1 + s0 + d1)>
module {
  func.func @conv2d_kernel_0d1234c567c8d91011de12de1314c15d16d17e18e19de20de21e22c23c24c25c26c27c28c29c(%arg0: i64, %arg1: i32, %arg2: i32, %arg3: i32, %arg4: i32, %arg5: i32, %arg6: i64, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32, %arg11: i32, %arg12: i64, %arg13: i64, %arg14: i32, %arg15: i32, %arg16: i32, %arg17: i32, %arg18: i32) attributes {llvm.emit_c_interface} {
    %c16 = arith.constant 16 : index
    %c8 = arith.constant 8 : index
    %false = arith.constant false
    %c1 = arith.constant 1 : index
    %c4 = arith.constant 4 : index
    %c0 = arith.constant 0 : index
    %c4_i64 = arith.constant 4 : i64
    %true = arith.constant true
    %c1_i32 = arith.constant 1 : i32
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0.000000e+00 : f32
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = tensor.empty() : tensor<1x4xi1>
    %2 = linalg.fill ins(%true : i1) outs(%1 : tensor<1x4xi1>) -> tensor<1x4xi1>
    %3 = tensor.empty() : tensor<4x1xi1>
    %4 = linalg.fill ins(%true : i1) outs(%3 : tensor<4x1xi1>) -> tensor<4x1xi1>
    scf.for %arg19 = %c0 to %c8 step %c1 {
      %5 = arith.index_cast %arg19 : index to i32
      %6 = arith.extsi %5 : i32 to i64
      %7 = arith.muli %6, %c4_i64 : i64
      %8 = arith.addi %arg12, %7 : i64
      %9 = llvm.inttoptr %8 : i64 to !llvm.ptr
      %view_memref = aux.view %9 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
      %10 = memref.load %view_memref[%c0] : memref<1xf32>
      %11 = arith.muli %5, %arg16 : i32
      %12 = arith.muli %5, %arg17 : i32
      %13 = arith.muli %5, %arg18 : i32
      %14 = tensor.empty() : tensor<4xi32>
      %15 = scf.for %arg20 = %c0 to %c4 step %c1 iter_args(%arg21 = %14) -> (tensor<4xi32>) {
        %64 = arith.index_cast %arg20 : index to i32
        %inserted = tensor.insert %64 into %arg21[%arg20] : tensor<4xi32>
        scf.yield %inserted : tensor<4xi32>
      }
      %16 = arith.subi %5, %c1_i32 : i32
      %17 = linalg.fill ins(%16 : i32) outs(%14 : tensor<4xi32>) -> tensor<4xi32>
      %mapped = linalg.map { arith.addi } ins(%17, %15 : tensor<4xi32>, tensor<4xi32>) outs(%14 : tensor<4xi32>)
      %expanded = tensor.expand_shape %mapped [[0, 1]] : tensor<4xi32> into tensor<4x1xi32>
      %18 = arith.index_cast %16 : i32 to index
      %19 = arith.addi %18, %c4 : index
      %20 = arith.maxsi %18, %c0 : index
      %21 = arith.minsi %19, %20 : index
      %22 = arith.subi %21, %18 : index
      %23 = tensor.empty(%22) : tensor<?x1xi1>
      %24 = linalg.fill ins(%true : i1) outs(%23 : tensor<?x1xi1>) -> tensor<?x1xi1>
      %25 = linalg.fill ins(%false : i1) outs(%3 : tensor<4x1xi1>) -> tensor<4x1xi1>
      %inserted_slice = tensor.insert_slice %24 into %25[0, 0] [%22, 1] [1, 1] : tensor<?x1xi1> into tensor<4x1xi1>
      %mapped_0 = linalg.map { arith.xori } ins(%inserted_slice, %4 : tensor<4x1xi1>, tensor<4x1xi1>) outs(%3 : tensor<4x1xi1>)
      %26 = arith.index_cast %arg4 : i32 to index
      %27 = arith.maxsi %26, %18 : index
      %28 = arith.minsi %19, %27 : index
      %29 = arith.subi %28, %18 : index
      %30 = tensor.empty(%29) : tensor<?x1xi1>
      %31 = linalg.fill ins(%true : i1) outs(%30 : tensor<?x1xi1>) -> tensor<?x1xi1>
      %inserted_slice_1 = tensor.insert_slice %31 into %25[0, 0] [%29, 1] [1, 1] : tensor<?x1xi1> into tensor<4x1xi1>
      %mapped_2 = linalg.map { arith.andi } ins(%inserted_slice_1, %mapped_0 : tensor<4x1xi1>, tensor<4x1xi1>) outs(%3 : tensor<4x1xi1>)
      %32 = tensor.empty() : tensor<4x1xi32>
      %33 = linalg.fill ins(%arg3 : i32) outs(%32 : tensor<4x1xi32>) -> tensor<4x1xi32>
      %mapped_3 = linalg.map { arith.muli } ins(%expanded, %33 : tensor<4x1xi32>, tensor<4x1xi32>) outs(%32 : tensor<4x1xi32>)
      %collapsed = tensor.collapse_shape %mapped_2 [[0, 1]] : tensor<4x1xi1> into tensor<4xi1>
      %34 = tensor.empty() : tensor<4x4xi1>
      %broadcasted = linalg.broadcast ins(%collapsed : tensor<4xi1>) outs(%34 : tensor<4x4xi1>) dimensions = [1] 
      %35 = arith.muli %5, %arg2 : i32
      %collapsed_4 = tensor.collapse_shape %mapped_3 [[0, 1]] : tensor<4x1xi32> into tensor<4xi32>
      %36 = tensor.empty() : tensor<4x4xi32>
      %broadcasted_5 = linalg.broadcast ins(%collapsed_4 : tensor<4xi32>) outs(%36 : tensor<4x4xi32>) dimensions = [1] 
      %37 = arith.muli %5, %arg9 : i32
      %38 = arith.muli %5, %arg10 : i32
      %39 = arith.addi %38, %37 : i32
      %40 = arith.index_cast %arg5 : i32 to index
      %41 = llvm.inttoptr %arg0 : i64 to !llvm.ptr
      %collapsed_6 = tensor.collapse_shape %0 [[0, 1]] : tensor<4x4xf32> into tensor<16xf32>
      %expanded_7 = tensor.expand_shape %collapsed_6 [[0, 1]] : tensor<16xf32> into tensor<16x1xf32>
      %42 = arith.index_cast %arg7 : i32 to index
      %43 = arith.maxsi %42, %c0 : index
      %44 = arith.minsi %43, %c4 : index
      %45 = arith.index_cast %arg8 : i32 to index
      %46 = arith.maxsi %45, %c0 : index
      %47 = arith.minsi %46, %c4 : index
      %48 = arith.minsi %44, %c4 : index
      %49 = arith.maxsi %48, %c0 : index
      %50 = arith.minsi %47, %c4 : index
      %51 = arith.maxsi %50, %c0 : index
      %extracted = tensor.extract %15[%c0] : tensor<4xi32>
      %52 = arith.muli %extracted, %arg11 : i32
      %53 = arith.addi %extracted, %52 : i32
      %54 = arith.addi %53, %39 : i32
      %extracted_8 = tensor.extract %15[%c1] : tensor<4xi32>
      %55 = arith.muli %extracted_8, %arg11 : i32
      %56 = arith.addi %extracted, %55 : i32
      %57 = arith.addi %56, %39 : i32
      %58 = arith.subi %57, %54 : i32
      %59 = arith.index_cast %58 : i32 to index
      %60 = arith.index_cast %54 : i32 to index
      %61 = llvm.inttoptr %arg6 : i64 to !llvm.ptr
      %62 = tensor.empty(%49, %51) : tensor<?x?xf32>
      %63 = tensor.empty() : tensor<f32>
      scf.for %arg20 = %c0_i32 to %arg15 step %c1_i32  : i32 {
        %64 = arith.subi %arg20, %c1_i32 : i32
        %65 = linalg.fill ins(%64 : i32) outs(%14 : tensor<4xi32>) -> tensor<4xi32>
        %mapped_9 = linalg.map { arith.addi } ins(%65, %15 : tensor<4xi32>, tensor<4xi32>) outs(%14 : tensor<4xi32>)
        %66 = arith.index_cast %64 : i32 to index
        %67 = arith.addi %66, %c4 : index
        %68 = arith.maxsi %66, %c0 : index
        %69 = arith.minsi %67, %68 : index
        %70 = arith.subi %69, %66 : index
        %71 = tensor.empty(%70) : tensor<1x?xi1>
        %72 = linalg.fill ins(%true : i1) outs(%71 : tensor<1x?xi1>) -> tensor<1x?xi1>
        %73 = linalg.fill ins(%false : i1) outs(%1 : tensor<1x4xi1>) -> tensor<1x4xi1>
        %inserted_slice_10 = tensor.insert_slice %72 into %73[0, 0] [1, %70] [1, 1] : tensor<1x?xi1> into tensor<1x4xi1>
        %mapped_11 = linalg.map { arith.xori } ins(%inserted_slice_10, %2 : tensor<1x4xi1>, tensor<1x4xi1>) outs(%1 : tensor<1x4xi1>)
        %74 = arith.maxsi %40, %66 : index
        %75 = arith.minsi %67, %74 : index
        %76 = arith.subi %75, %66 : index
        %77 = tensor.empty(%76) : tensor<1x?xi1>
        %78 = linalg.fill ins(%true : i1) outs(%77 : tensor<1x?xi1>) -> tensor<1x?xi1>
        %inserted_slice_12 = tensor.insert_slice %78 into %73[0, 0] [1, %76] [1, 1] : tensor<1x?xi1> into tensor<1x4xi1>
        %mapped_13 = linalg.map { arith.andi } ins(%inserted_slice_12, %mapped_11 : tensor<1x4xi1>, tensor<1x4xi1>) outs(%1 : tensor<1x4xi1>)
        %collapsed_14 = tensor.collapse_shape %mapped_13 [[0, 1]] : tensor<1x4xi1> into tensor<4xi1>
        %broadcasted_15 = linalg.broadcast ins(%collapsed_14 : tensor<4xi1>) outs(%34 : tensor<4x4xi1>) dimensions = [0] 
        %mapped_16 = linalg.map { arith.andi } ins(%broadcasted, %broadcasted_15 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%34 : tensor<4x4xi1>)
        %broadcasted_17 = linalg.broadcast ins(%mapped_9 : tensor<4xi32>) outs(%36 : tensor<4x4xi32>) dimensions = [0] 
        %mapped_18 = linalg.map { arith.addi } ins(%broadcasted_17, %broadcasted_5 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%36 : tensor<4x4xi32>)
        %79 = linalg.fill ins(%35 : i32) outs(%36 : tensor<4x4xi32>) -> tensor<4x4xi32>
        %mapped_19 = linalg.map { arith.addi } ins(%mapped_18, %79 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%36 : tensor<4x4xi32>)
        %view_memref_20 = aux.view %41 to offset: [0], sizes: [9223372036854775807], strides: [1] : !llvm.ptr to memref<9223372036854775807xf32>
        %80 = bufferization.to_tensor %view_memref_20 restrict writable : memref<9223372036854775807xf32>
        %81 = linalg.fill ins(%cst : f32) outs(%expanded_7 : tensor<16x1xf32>) -> tensor<16x1xf32>
        %collapsed_21 = tensor.collapse_shape %mapped_19 [[0, 1]] : tensor<4x4xi32> into tensor<16xi32>
        %expanded_22 = tensor.expand_shape %collapsed_21 [[0, 1]] : tensor<16xi32> into tensor<16x1xi32>
        %collapsed_23 = tensor.collapse_shape %mapped_16 [[0, 1]] : tensor<4x4xi1> into tensor<16xi1>
        %82 = scf.for %arg21 = %c0 to %c16 step %c1 iter_args(%arg22 = %81) -> (tensor<16x1xf32>) {
          %extracted_32 = tensor.extract %collapsed_23[%arg21] : tensor<16xi1>
          %96 = scf.if %extracted_32 -> (tensor<16x1xf32>) {
            %extracted_33 = tensor.extract %expanded_22[%arg21, %c0] : tensor<16x1xi32>
            %97 = arith.index_cast %extracted_33 : i32 to index
            %extracted_34 = tensor.extract %80[%97] : tensor<9223372036854775807xf32>
            %inserted = tensor.insert %extracted_34 into %arg22[%arg21, %c0] : tensor<16x1xf32>
            scf.yield %inserted : tensor<16x1xf32>
          } else {
            scf.yield %arg22 : tensor<16x1xf32>
          }
          scf.yield %96 : tensor<16x1xf32>
        }
        %collapsed_24 = tensor.collapse_shape %82 [[0, 1]] : tensor<16x1xf32> into tensor<16xf32>
        %expanded_25 = tensor.expand_shape %collapsed_24 [[0, 1]] : tensor<16xf32> into tensor<4x4xf32>
        %view_memref_26 = aux.view %61 to offset: [%60], sizes: [%49, %51], strides: [%59, 1] : !llvm.ptr to memref<?x?xf32, #map>
        %83 = bufferization.to_tensor %view_memref_26 restrict writable : memref<?x?xf32, #map>
        %84 = linalg.copy ins(%83 : tensor<?x?xf32>) outs(%62 : tensor<?x?xf32>) -> tensor<?x?xf32>
        %85 = linalg.fill ins(%cst : f32) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
        %inserted_slice_27 = tensor.insert_slice %84 into %85[0, 0] [%49, %51] [1, 1] : tensor<?x?xf32> into tensor<4x4xf32>
        %mapped_28 = linalg.map { arith.mulf } ins(%expanded_25, %inserted_slice_27 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>)
        %collapsed_29 = tensor.collapse_shape %mapped_28 [[0, 1]] : tensor<4x4xf32> into tensor<16xf32>
        %86 = linalg.fill ins(%cst : f32) outs(%63 : tensor<f32>) -> tensor<f32>
        %reduced = linalg.reduce ins(%collapsed_29 : tensor<16xf32>) outs(%86 : tensor<f32>) dimensions = [0] 
          (%in: f32, %init: f32) {
            %96 = arith.addf %in, %init : f32
            linalg.yield %96 : f32
          }
        %extracted_30 = tensor.extract %reduced[] : tensor<f32>
        %87 = arith.addf %extracted_30, %cst : f32
        %88 = arith.addi %arg20, %13 : i32
        %89 = arith.addi %88, %12 : i32
        %90 = arith.addi %89, %11 : i32
        %91 = arith.extsi %90 : i32 to i64
        %92 = arith.muli %91, %c4_i64 : i64
        %93 = arith.addi %arg13, %92 : i64
        %94 = arith.addf %87, %10 : f32
        %95 = llvm.inttoptr %93 : i64 to !llvm.ptr
        %view_memref_31 = aux.view %95 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
        memref.store %94, %view_memref_31[%c0] : memref<1xf32>
      }
    }
    return
  }
}


// -----// IR Dump Before OneShotBufferize (one-shot-bufferize) //----- //
#map = affine_map<(d0, d1)[s0, s1] -> (d0 * s1 + s0 + d1)>
module {
  func.func @conv2d_kernel_0d1234c567c8d91011de12de1314c15d16d17e18e19de20de21e22c23c24c25c26c27c28c29c(%arg0: i64, %arg1: i32, %arg2: i32, %arg3: i32, %arg4: i32, %arg5: i32, %arg6: i64, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32, %arg11: i32, %arg12: i64, %arg13: i64, %arg14: i32, %arg15: i32, %arg16: i32, %arg17: i32, %arg18: i32) attributes {llvm.emit_c_interface} {
    %c16 = arith.constant 16 : index
    %c8 = arith.constant 8 : index
    %false = arith.constant false
    %c1 = arith.constant 1 : index
    %c4 = arith.constant 4 : index
    %c0 = arith.constant 0 : index
    %c4_i64 = arith.constant 4 : i64
    %true = arith.constant true
    %c1_i32 = arith.constant 1 : i32
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0.000000e+00 : f32
    %0 = bufferization.alloc_tensor() : tensor<4x4xf32>
    %1 = bufferization.alloc_tensor() : tensor<1x4xi1>
    %2 = linalg.fill ins(%true : i1) outs(%1 : tensor<1x4xi1>) -> tensor<1x4xi1>
    %3 = bufferization.alloc_tensor() : tensor<4x1xi1>
    %4 = linalg.fill ins(%true : i1) outs(%3 : tensor<4x1xi1>) -> tensor<4x1xi1>
    scf.for %arg19 = %c0 to %c8 step %c1 {
      %5 = arith.index_cast %arg19 : index to i32
      %6 = arith.extsi %5 : i32 to i64
      %7 = arith.muli %6, %c4_i64 : i64
      %8 = arith.addi %arg12, %7 : i64
      %9 = llvm.inttoptr %8 : i64 to !llvm.ptr
      %view_memref = aux.view %9 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
      %10 = memref.load %view_memref[%c0] : memref<1xf32>
      %11 = arith.muli %5, %arg16 : i32
      %12 = arith.muli %5, %arg17 : i32
      %13 = arith.muli %5, %arg18 : i32
      %14 = bufferization.alloc_tensor() : tensor<4xi32>
      %15 = scf.for %arg20 = %c0 to %c4 step %c1 iter_args(%arg21 = %14) -> (tensor<4xi32>) {
        %64 = arith.index_cast %arg20 : index to i32
        %inserted = tensor.insert %64 into %arg21[%arg20] : tensor<4xi32>
        scf.yield %inserted : tensor<4xi32>
      }
      %16 = arith.subi %5, %c1_i32 : i32
      %17 = linalg.fill ins(%16 : i32) outs(%14 : tensor<4xi32>) -> tensor<4xi32>
      %mapped = linalg.map { arith.addi } ins(%17, %15 : tensor<4xi32>, tensor<4xi32>) outs(%14 : tensor<4xi32>)
      %expanded = tensor.expand_shape %mapped [[0, 1]] : tensor<4xi32> into tensor<4x1xi32>
      %18 = arith.index_cast %16 : i32 to index
      %19 = arith.addi %18, %c4 : index
      %20 = arith.maxsi %18, %c0 : index
      %21 = arith.minsi %19, %20 : index
      %22 = arith.subi %21, %18 : index
      %23 = bufferization.alloc_tensor(%22) : tensor<?x1xi1>
      %24 = linalg.fill ins(%true : i1) outs(%23 : tensor<?x1xi1>) -> tensor<?x1xi1>
      %25 = linalg.fill ins(%false : i1) outs(%3 : tensor<4x1xi1>) -> tensor<4x1xi1>
      %inserted_slice = tensor.insert_slice %24 into %25[0, 0] [%22, 1] [1, 1] : tensor<?x1xi1> into tensor<4x1xi1>
      %mapped_0 = linalg.map { arith.xori } ins(%inserted_slice, %4 : tensor<4x1xi1>, tensor<4x1xi1>) outs(%3 : tensor<4x1xi1>)
      %26 = arith.index_cast %arg4 : i32 to index
      %27 = arith.maxsi %26, %18 : index
      %28 = arith.minsi %19, %27 : index
      %29 = arith.subi %28, %18 : index
      %30 = bufferization.alloc_tensor(%29) : tensor<?x1xi1>
      %31 = linalg.fill ins(%true : i1) outs(%30 : tensor<?x1xi1>) -> tensor<?x1xi1>
      %inserted_slice_1 = tensor.insert_slice %31 into %25[0, 0] [%29, 1] [1, 1] : tensor<?x1xi1> into tensor<4x1xi1>
      %mapped_2 = linalg.map { arith.andi } ins(%inserted_slice_1, %mapped_0 : tensor<4x1xi1>, tensor<4x1xi1>) outs(%3 : tensor<4x1xi1>)
      %32 = bufferization.alloc_tensor() : tensor<4x1xi32>
      %33 = linalg.fill ins(%arg3 : i32) outs(%32 : tensor<4x1xi32>) -> tensor<4x1xi32>
      %mapped_3 = linalg.map { arith.muli } ins(%expanded, %33 : tensor<4x1xi32>, tensor<4x1xi32>) outs(%32 : tensor<4x1xi32>)
      %collapsed = tensor.collapse_shape %mapped_2 [[0, 1]] : tensor<4x1xi1> into tensor<4xi1>
      %34 = bufferization.alloc_tensor() : tensor<4x4xi1>
      %broadcasted = linalg.broadcast ins(%collapsed : tensor<4xi1>) outs(%34 : tensor<4x4xi1>) dimensions = [1] 
      %35 = arith.muli %5, %arg2 : i32
      %collapsed_4 = tensor.collapse_shape %mapped_3 [[0, 1]] : tensor<4x1xi32> into tensor<4xi32>
      %36 = bufferization.alloc_tensor() : tensor<4x4xi32>
      %broadcasted_5 = linalg.broadcast ins(%collapsed_4 : tensor<4xi32>) outs(%36 : tensor<4x4xi32>) dimensions = [1] 
      %37 = arith.muli %5, %arg9 : i32
      %38 = arith.muli %5, %arg10 : i32
      %39 = arith.addi %38, %37 : i32
      %40 = arith.index_cast %arg5 : i32 to index
      %41 = llvm.inttoptr %arg0 : i64 to !llvm.ptr
      %collapsed_6 = tensor.collapse_shape %0 [[0, 1]] : tensor<4x4xf32> into tensor<16xf32>
      %expanded_7 = tensor.expand_shape %collapsed_6 [[0, 1]] : tensor<16xf32> into tensor<16x1xf32>
      %42 = arith.index_cast %arg7 : i32 to index
      %43 = arith.maxsi %42, %c0 : index
      %44 = arith.minsi %43, %c4 : index
      %45 = arith.index_cast %arg8 : i32 to index
      %46 = arith.maxsi %45, %c0 : index
      %47 = arith.minsi %46, %c4 : index
      %48 = arith.minsi %44, %c4 : index
      %49 = arith.maxsi %48, %c0 : index
      %50 = arith.minsi %47, %c4 : index
      %51 = arith.maxsi %50, %c0 : index
      %extracted = tensor.extract %15[%c0] : tensor<4xi32>
      %52 = arith.muli %extracted, %arg11 : i32
      %53 = arith.addi %extracted, %52 : i32
      %54 = arith.addi %53, %39 : i32
      %extracted_8 = tensor.extract %15[%c1] : tensor<4xi32>
      %55 = arith.muli %extracted_8, %arg11 : i32
      %56 = arith.addi %extracted, %55 : i32
      %57 = arith.addi %56, %39 : i32
      %58 = arith.subi %57, %54 : i32
      %59 = arith.index_cast %58 : i32 to index
      %60 = arith.index_cast %54 : i32 to index
      %61 = llvm.inttoptr %arg6 : i64 to !llvm.ptr
      %62 = bufferization.alloc_tensor(%49, %51) : tensor<?x?xf32>
      %63 = bufferization.alloc_tensor() : tensor<f32>
      scf.for %arg20 = %c0_i32 to %arg15 step %c1_i32  : i32 {
        %64 = arith.subi %arg20, %c1_i32 : i32
        %65 = linalg.fill ins(%64 : i32) outs(%14 : tensor<4xi32>) -> tensor<4xi32>
        %mapped_9 = linalg.map { arith.addi } ins(%65, %15 : tensor<4xi32>, tensor<4xi32>) outs(%14 : tensor<4xi32>)
        %66 = arith.index_cast %64 : i32 to index
        %67 = arith.addi %66, %c4 : index
        %68 = arith.maxsi %66, %c0 : index
        %69 = arith.minsi %67, %68 : index
        %70 = arith.subi %69, %66 : index
        %71 = bufferization.alloc_tensor(%70) : tensor<1x?xi1>
        %72 = linalg.fill ins(%true : i1) outs(%71 : tensor<1x?xi1>) -> tensor<1x?xi1>
        %73 = linalg.fill ins(%false : i1) outs(%1 : tensor<1x4xi1>) -> tensor<1x4xi1>
        %inserted_slice_10 = tensor.insert_slice %72 into %73[0, 0] [1, %70] [1, 1] : tensor<1x?xi1> into tensor<1x4xi1>
        %mapped_11 = linalg.map { arith.xori } ins(%inserted_slice_10, %2 : tensor<1x4xi1>, tensor<1x4xi1>) outs(%1 : tensor<1x4xi1>)
        %74 = arith.maxsi %40, %66 : index
        %75 = arith.minsi %67, %74 : index
        %76 = arith.subi %75, %66 : index
        %77 = bufferization.alloc_tensor(%76) : tensor<1x?xi1>
        %78 = linalg.fill ins(%true : i1) outs(%77 : tensor<1x?xi1>) -> tensor<1x?xi1>
        %inserted_slice_12 = tensor.insert_slice %78 into %73[0, 0] [1, %76] [1, 1] : tensor<1x?xi1> into tensor<1x4xi1>
        %mapped_13 = linalg.map { arith.andi } ins(%inserted_slice_12, %mapped_11 : tensor<1x4xi1>, tensor<1x4xi1>) outs(%1 : tensor<1x4xi1>)
        %collapsed_14 = tensor.collapse_shape %mapped_13 [[0, 1]] : tensor<1x4xi1> into tensor<4xi1>
        %broadcasted_15 = linalg.broadcast ins(%collapsed_14 : tensor<4xi1>) outs(%34 : tensor<4x4xi1>) dimensions = [0] 
        %mapped_16 = linalg.map { arith.andi } ins(%broadcasted, %broadcasted_15 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%34 : tensor<4x4xi1>)
        %broadcasted_17 = linalg.broadcast ins(%mapped_9 : tensor<4xi32>) outs(%36 : tensor<4x4xi32>) dimensions = [0] 
        %mapped_18 = linalg.map { arith.addi } ins(%broadcasted_17, %broadcasted_5 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%36 : tensor<4x4xi32>)
        %79 = linalg.fill ins(%35 : i32) outs(%36 : tensor<4x4xi32>) -> tensor<4x4xi32>
        %mapped_19 = linalg.map { arith.addi } ins(%mapped_18, %79 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%36 : tensor<4x4xi32>)
        %view_memref_20 = aux.view %41 to offset: [0], sizes: [9223372036854775807], strides: [1] : !llvm.ptr to memref<9223372036854775807xf32>
        %80 = bufferization.to_tensor %view_memref_20 restrict writable : memref<9223372036854775807xf32>
        %81 = linalg.fill ins(%cst : f32) outs(%expanded_7 : tensor<16x1xf32>) -> tensor<16x1xf32>
        %collapsed_21 = tensor.collapse_shape %mapped_19 [[0, 1]] : tensor<4x4xi32> into tensor<16xi32>
        %expanded_22 = tensor.expand_shape %collapsed_21 [[0, 1]] : tensor<16xi32> into tensor<16x1xi32>
        %collapsed_23 = tensor.collapse_shape %mapped_16 [[0, 1]] : tensor<4x4xi1> into tensor<16xi1>
        %82 = scf.for %arg21 = %c0 to %c16 step %c1 iter_args(%arg22 = %81) -> (tensor<16x1xf32>) {
          %extracted_32 = tensor.extract %collapsed_23[%arg21] : tensor<16xi1>
          %96 = scf.if %extracted_32 -> (tensor<16x1xf32>) {
            %extracted_33 = tensor.extract %expanded_22[%arg21, %c0] : tensor<16x1xi32>
            %97 = arith.index_cast %extracted_33 : i32 to index
            %extracted_34 = tensor.extract %80[%97] : tensor<9223372036854775807xf32>
            %inserted = tensor.insert %extracted_34 into %arg22[%arg21, %c0] : tensor<16x1xf32>
            scf.yield %inserted : tensor<16x1xf32>
          } else {
            scf.yield %arg22 : tensor<16x1xf32>
          }
          scf.yield %96 : tensor<16x1xf32>
        }
        %collapsed_24 = tensor.collapse_shape %82 [[0, 1]] : tensor<16x1xf32> into tensor<16xf32>
        %expanded_25 = tensor.expand_shape %collapsed_24 [[0, 1]] : tensor<16xf32> into tensor<4x4xf32>
        %view_memref_26 = aux.view %61 to offset: [%60], sizes: [%49, %51], strides: [%59, 1] : !llvm.ptr to memref<?x?xf32, #map>
        %83 = bufferization.to_tensor %view_memref_26 restrict writable : memref<?x?xf32, #map>
        %84 = linalg.copy ins(%83 : tensor<?x?xf32>) outs(%62 : tensor<?x?xf32>) -> tensor<?x?xf32>
        %85 = linalg.fill ins(%cst : f32) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
        %inserted_slice_27 = tensor.insert_slice %84 into %85[0, 0] [%49, %51] [1, 1] : tensor<?x?xf32> into tensor<4x4xf32>
        %mapped_28 = linalg.map { arith.mulf } ins(%expanded_25, %inserted_slice_27 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>)
        %collapsed_29 = tensor.collapse_shape %mapped_28 [[0, 1]] : tensor<4x4xf32> into tensor<16xf32>
        %86 = linalg.fill ins(%cst : f32) outs(%63 : tensor<f32>) -> tensor<f32>
        %reduced = linalg.reduce ins(%collapsed_29 : tensor<16xf32>) outs(%86 : tensor<f32>) dimensions = [0] 
          (%in: f32, %init: f32) {
            %96 = arith.addf %in, %init : f32
            linalg.yield %96 : f32
          }
        %extracted_30 = tensor.extract %reduced[] : tensor<f32>
        %87 = arith.addf %extracted_30, %cst : f32
        %88 = arith.addi %arg20, %13 : i32
        %89 = arith.addi %88, %12 : i32
        %90 = arith.addi %89, %11 : i32
        %91 = arith.extsi %90 : i32 to i64
        %92 = arith.muli %91, %c4_i64 : i64
        %93 = arith.addi %arg13, %92 : i64
        %94 = arith.addf %87, %10 : f32
        %95 = llvm.inttoptr %93 : i64 to !llvm.ptr
        %view_memref_31 = aux.view %95 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
        memref.store %94, %view_memref_31[%c0] : memref<1xf32>
      }
    }
    return
  }
}


// -----// IR Dump Before ConvertAffineToStandard (lower-affine) //----- //
#map = affine_map<(d0, d1)[s0, s1] -> (d0 * s1 + s0 + d1)>
module {
  func.func @conv2d_kernel_0d1234c567c8d91011de12de1314c15d16d17e18e19de20de21e22c23c24c25c26c27c28c29c(%arg0: i64, %arg1: i32, %arg2: i32, %arg3: i32, %arg4: i32, %arg5: i32, %arg6: i64, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32, %arg11: i32, %arg12: i64, %arg13: i64, %arg14: i32, %arg15: i32, %arg16: i32, %arg17: i32, %arg18: i32) attributes {llvm.emit_c_interface} {
    %c16 = arith.constant 16 : index
    %c8 = arith.constant 8 : index
    %false = arith.constant false
    %c1 = arith.constant 1 : index
    %c4 = arith.constant 4 : index
    %c0 = arith.constant 0 : index
    %c4_i64 = arith.constant 4 : i64
    %true = arith.constant true
    %c1_i32 = arith.constant 1 : i32
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0.000000e+00 : f32
    %alloc = memref.alloc() {alignment = 64 : i64} : memref<4x4xf32>
    %alloc_0 = memref.alloc() {alignment = 64 : i64} : memref<1x4xi1>
    %alloc_1 = memref.alloc() {alignment = 64 : i64} : memref<1x4xi1>
    linalg.fill ins(%true : i1) outs(%alloc_1 : memref<1x4xi1>)
    %alloc_2 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi1>
    %alloc_3 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi1>
    linalg.fill ins(%true : i1) outs(%alloc_3 : memref<4x1xi1>)
    scf.for %arg19 = %c0 to %c8 step %c1 {
      %0 = arith.index_cast %arg19 : index to i32
      %1 = arith.extsi %0 : i32 to i64
      %2 = arith.muli %1, %c4_i64 : i64
      %3 = arith.addi %arg12, %2 : i64
      %4 = llvm.inttoptr %3 : i64 to !llvm.ptr
      %view_memref = aux.view %4 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
      %5 = memref.load %view_memref[%c0] : memref<1xf32>
      %6 = arith.muli %0, %arg16 : i32
      %7 = arith.muli %0, %arg17 : i32
      %8 = arith.muli %0, %arg18 : i32
      %alloc_4 = memref.alloc() {alignment = 64 : i64} : memref<4xi32>
      %alloc_5 = memref.alloc() {alignment = 64 : i64} : memref<4xi32>
      %9 = scf.for %arg20 = %c0 to %c4 step %c1 iter_args(%arg21 = %alloc_5) -> (memref<4xi32>) {
        %48 = arith.index_cast %arg20 : index to i32
        memref.store %48, %arg21[%arg20] : memref<4xi32>
        scf.yield %arg21 : memref<4xi32>
      }
      %10 = arith.subi %0, %c1_i32 : i32
      linalg.fill ins(%10 : i32) outs(%alloc_4 : memref<4xi32>)
      linalg.map { arith.addi } ins(%alloc_4, %9 : memref<4xi32>, memref<4xi32>) outs(%alloc_4 : memref<4xi32>)
      %expand_shape = memref.expand_shape %alloc_4 [[0, 1]] : memref<4xi32> into memref<4x1xi32>
      %11 = arith.index_cast %10 : i32 to index
      %12 = arith.addi %11, %c4 : index
      %13 = arith.maxsi %11, %c0 : index
      %14 = arith.minsi %12, %13 : index
      %15 = arith.subi %14, %11 : index
      %alloc_6 = memref.alloc(%15) {alignment = 64 : i64} : memref<?x1xi1>
      linalg.fill ins(%true : i1) outs(%alloc_6 : memref<?x1xi1>)
      %alloc_7 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi1>
      linalg.fill ins(%false : i1) outs(%alloc_7 : memref<4x1xi1>)
      %alloc_8 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi1>
      memref.copy %alloc_7, %alloc_8 : memref<4x1xi1> to memref<4x1xi1>
      %subview = memref.subview %alloc_8[0, 0] [%15, 1] [1, 1] : memref<4x1xi1> to memref<?x1xi1, strided<[1, 1]>>
      memref.copy %alloc_6, %subview : memref<?x1xi1> to memref<?x1xi1, strided<[1, 1]>>
      linalg.map { arith.xori } ins(%alloc_8, %alloc_3 : memref<4x1xi1>, memref<4x1xi1>) outs(%alloc_2 : memref<4x1xi1>)
      %16 = arith.index_cast %arg4 : i32 to index
      %17 = arith.maxsi %16, %11 : index
      %18 = arith.minsi %12, %17 : index
      %19 = arith.subi %18, %11 : index
      %alloc_9 = memref.alloc(%19) {alignment = 64 : i64} : memref<?x1xi1>
      linalg.fill ins(%true : i1) outs(%alloc_9 : memref<?x1xi1>)
      %subview_10 = memref.subview %alloc_7[0, 0] [%19, 1] [1, 1] : memref<4x1xi1> to memref<?x1xi1, strided<[1, 1]>>
      memref.copy %alloc_9, %subview_10 : memref<?x1xi1> to memref<?x1xi1, strided<[1, 1]>>
      linalg.map { arith.andi } ins(%alloc_7, %alloc_2 : memref<4x1xi1>, memref<4x1xi1>) outs(%alloc_2 : memref<4x1xi1>)
      %alloc_11 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi32>
      linalg.fill ins(%arg3 : i32) outs(%alloc_11 : memref<4x1xi32>)
      linalg.map { arith.muli } ins(%expand_shape, %alloc_11 : memref<4x1xi32>, memref<4x1xi32>) outs(%alloc_11 : memref<4x1xi32>)
      %collapse_shape = memref.collapse_shape %alloc_2 [[0, 1]] : memref<4x1xi1> into memref<4xi1>
      %alloc_12 = memref.alloc() {alignment = 64 : i64} : memref<4x4xi1>
      %alloc_13 = memref.alloc() {alignment = 64 : i64} : memref<4x4xi1>
      linalg.broadcast ins(%collapse_shape : memref<4xi1>) outs(%alloc_13 : memref<4x4xi1>) dimensions = [1] 
      %20 = arith.muli %0, %arg2 : i32
      %collapse_shape_14 = memref.collapse_shape %alloc_11 [[0, 1]] : memref<4x1xi32> into memref<4xi32>
      %alloc_15 = memref.alloc() {alignment = 64 : i64} : memref<4x4xi32>
      %alloc_16 = memref.alloc() {alignment = 64 : i64} : memref<4x4xi32>
      linalg.broadcast ins(%collapse_shape_14 : memref<4xi32>) outs(%alloc_16 : memref<4x4xi32>) dimensions = [1] 
      %21 = arith.muli %0, %arg9 : i32
      %22 = arith.muli %0, %arg10 : i32
      %23 = arith.addi %22, %21 : i32
      %24 = arith.index_cast %arg5 : i32 to index
      %25 = llvm.inttoptr %arg0 : i64 to !llvm.ptr
      %collapse_shape_17 = memref.collapse_shape %alloc [[0, 1]] : memref<4x4xf32> into memref<16xf32>
      %alloc_18 = memref.alloc() {alignment = 64 : i64} : memref<16xf32>
      %expand_shape_19 = memref.expand_shape %alloc_18 [[0, 1]] : memref<16xf32> into memref<16x1xf32>
      %26 = arith.index_cast %arg7 : i32 to index
      %27 = arith.maxsi %26, %c0 : index
      %28 = arith.minsi %27, %c4 : index
      %29 = arith.index_cast %arg8 : i32 to index
      %30 = arith.maxsi %29, %c0 : index
      %31 = arith.minsi %30, %c4 : index
      %32 = arith.minsi %28, %c4 : index
      %33 = arith.maxsi %32, %c0 : index
      %34 = arith.minsi %31, %c4 : index
      %35 = arith.maxsi %34, %c0 : index
      %36 = memref.load %9[%c0] : memref<4xi32>
      %37 = arith.muli %36, %arg11 : i32
      %38 = arith.addi %36, %37 : i32
      %39 = arith.addi %38, %23 : i32
      %40 = memref.load %9[%c1] : memref<4xi32>
      %41 = arith.muli %40, %arg11 : i32
      %42 = arith.addi %36, %41 : i32
      %43 = arith.addi %42, %23 : i32
      %44 = arith.subi %43, %39 : i32
      %45 = arith.index_cast %44 : i32 to index
      %46 = arith.index_cast %39 : i32 to index
      %47 = llvm.inttoptr %arg6 : i64 to !llvm.ptr
      %alloc_20 = memref.alloc(%33, %35) {alignment = 64 : i64} : memref<?x?xf32>
      %alloc_21 = memref.alloc() {alignment = 64 : i64} : memref<f32>
      scf.for %arg20 = %c0_i32 to %arg15 step %c1_i32  : i32 {
        %48 = arith.subi %arg20, %c1_i32 : i32
        linalg.fill ins(%48 : i32) outs(%alloc_4 : memref<4xi32>)
        linalg.map { arith.addi } ins(%alloc_4, %9 : memref<4xi32>, memref<4xi32>) outs(%alloc_4 : memref<4xi32>)
        %49 = arith.index_cast %48 : i32 to index
        %50 = arith.addi %49, %c4 : index
        %51 = arith.maxsi %49, %c0 : index
        %52 = arith.minsi %50, %51 : index
        %53 = arith.subi %52, %49 : index
        %alloc_22 = memref.alloc(%53) {alignment = 64 : i64} : memref<1x?xi1>
        linalg.fill ins(%true : i1) outs(%alloc_22 : memref<1x?xi1>)
        %alloc_23 = memref.alloc() {alignment = 64 : i64} : memref<1x4xi1>
        linalg.fill ins(%false : i1) outs(%alloc_23 : memref<1x4xi1>)
        %alloc_24 = memref.alloc() {alignment = 64 : i64} : memref<1x4xi1>
        memref.copy %alloc_23, %alloc_24 : memref<1x4xi1> to memref<1x4xi1>
        %subview_25 = memref.subview %alloc_24[0, 0] [1, %53] [1, 1] : memref<1x4xi1> to memref<1x?xi1, strided<[4, 1]>>
        memref.copy %alloc_22, %subview_25 : memref<1x?xi1> to memref<1x?xi1, strided<[4, 1]>>
        linalg.map { arith.xori } ins(%alloc_24, %alloc_1 : memref<1x4xi1>, memref<1x4xi1>) outs(%alloc_0 : memref<1x4xi1>)
        %54 = arith.maxsi %24, %49 : index
        %55 = arith.minsi %50, %54 : index
        %56 = arith.subi %55, %49 : index
        %alloc_26 = memref.alloc(%56) {alignment = 64 : i64} : memref<1x?xi1>
        linalg.fill ins(%true : i1) outs(%alloc_26 : memref<1x?xi1>)
        %subview_27 = memref.subview %alloc_23[0, 0] [1, %56] [1, 1] : memref<1x4xi1> to memref<1x?xi1, strided<[4, 1]>>
        memref.copy %alloc_26, %subview_27 : memref<1x?xi1> to memref<1x?xi1, strided<[4, 1]>>
        linalg.map { arith.andi } ins(%alloc_23, %alloc_0 : memref<1x4xi1>, memref<1x4xi1>) outs(%alloc_0 : memref<1x4xi1>)
        %collapse_shape_28 = memref.collapse_shape %alloc_0 [[0, 1]] : memref<1x4xi1> into memref<4xi1>
        linalg.broadcast ins(%collapse_shape_28 : memref<4xi1>) outs(%alloc_12 : memref<4x4xi1>) dimensions = [0] 
        linalg.map { arith.andi } ins(%alloc_13, %alloc_12 : memref<4x4xi1>, memref<4x4xi1>) outs(%alloc_12 : memref<4x4xi1>)
        linalg.broadcast ins(%alloc_4 : memref<4xi32>) outs(%alloc_15 : memref<4x4xi32>) dimensions = [0] 
        %alloc_29 = memref.alloc() {alignment = 64 : i64} : memref<4x4xi32>
        linalg.map { arith.addi } ins(%alloc_15, %alloc_16 : memref<4x4xi32>, memref<4x4xi32>) outs(%alloc_29 : memref<4x4xi32>)
        linalg.fill ins(%20 : i32) outs(%alloc_15 : memref<4x4xi32>)
        linalg.map { arith.addi } ins(%alloc_29, %alloc_15 : memref<4x4xi32>, memref<4x4xi32>) outs(%alloc_15 : memref<4x4xi32>)
        %view_memref_30 = aux.view %25 to offset: [0], sizes: [9223372036854775807], strides: [1] : !llvm.ptr to memref<9223372036854775807xf32>
        linalg.fill ins(%cst : f32) outs(%expand_shape_19 : memref<16x1xf32>)
        %collapse_shape_31 = memref.collapse_shape %alloc_15 [[0, 1]] : memref<4x4xi32> into memref<16xi32>
        %expand_shape_32 = memref.expand_shape %collapse_shape_31 [[0, 1]] : memref<16xi32> into memref<16x1xi32>
        %collapse_shape_33 = memref.collapse_shape %alloc_12 [[0, 1]] : memref<4x4xi1> into memref<16xi1>
        %57 = scf.for %arg21 = %c0 to %c16 step %c1 iter_args(%arg22 = %expand_shape_19) -> (memref<16x1xf32>) {
          %68 = memref.load %collapse_shape_33[%arg21] : memref<16xi1>
          %69 = scf.if %68 -> (memref<16x1xf32>) {
            %70 = memref.load %expand_shape_32[%arg21, %c0] : memref<16x1xi32>
            %71 = arith.index_cast %70 : i32 to index
            %72 = memref.load %view_memref_30[%71] : memref<9223372036854775807xf32>
            memref.store %72, %arg22[%arg21, %c0] : memref<16x1xf32>
            scf.yield %arg22 : memref<16x1xf32>
          } else {
            scf.yield %arg22 : memref<16x1xf32>
          }
          scf.yield %69 : memref<16x1xf32>
        }
        %collapse_shape_34 = memref.collapse_shape %57 [[0, 1]] : memref<16x1xf32> into memref<16xf32>
        %expand_shape_35 = memref.expand_shape %collapse_shape_34 [[0, 1]] : memref<16xf32> into memref<4x4xf32>
        %view_memref_36 = aux.view %47 to offset: [%46], sizes: [%33, %35], strides: [%45, 1] : !llvm.ptr to memref<?x?xf32, #map>
        linalg.copy ins(%view_memref_36 : memref<?x?xf32, #map>) outs(%alloc_20 : memref<?x?xf32>)
        linalg.fill ins(%cst : f32) outs(%alloc : memref<4x4xf32>)
        %subview_37 = memref.subview %alloc[0, 0] [%33, %35] [1, 1] : memref<4x4xf32> to memref<?x?xf32, strided<[4, 1]>>
        memref.copy %alloc_20, %subview_37 : memref<?x?xf32> to memref<?x?xf32, strided<[4, 1]>>
        linalg.map { arith.mulf } ins(%expand_shape_35, %alloc : memref<4x4xf32>, memref<4x4xf32>) outs(%alloc : memref<4x4xf32>)
        %collapse_shape_38 = memref.collapse_shape %alloc [[0, 1]] : memref<4x4xf32> into memref<16xf32>
        linalg.fill ins(%cst : f32) outs(%alloc_21 : memref<f32>)
        linalg.reduce ins(%collapse_shape_38 : memref<16xf32>) outs(%alloc_21 : memref<f32>) dimensions = [0] 
          (%in: f32, %init: f32) {
            %68 = arith.addf %in, %init : f32
            linalg.yield %68 : f32
          }
        %58 = memref.load %alloc_21[] : memref<f32>
        %59 = arith.addf %58, %cst : f32
        %60 = arith.addi %arg20, %8 : i32
        %61 = arith.addi %60, %7 : i32
        %62 = arith.addi %61, %6 : i32
        %63 = arith.extsi %62 : i32 to i64
        %64 = arith.muli %63, %c4_i64 : i64
        %65 = arith.addi %arg13, %64 : i64
        %66 = arith.addf %59, %5 : f32
        %67 = llvm.inttoptr %65 : i64 to !llvm.ptr
        %view_memref_39 = aux.view %67 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
        memref.store %66, %view_memref_39[%c0] : memref<1xf32>
      }
    }
    return
  }
}


// -----// IR Dump Before LinalgLowerToLoops (convert-linalg-to-loops) //----- //
#map = affine_map<(d0, d1)[s0, s1] -> (d0 * s1 + s0 + d1)>
module {
  func.func @conv2d_kernel_0d1234c567c8d91011de12de1314c15d16d17e18e19de20de21e22c23c24c25c26c27c28c29c(%arg0: i64, %arg1: i32, %arg2: i32, %arg3: i32, %arg4: i32, %arg5: i32, %arg6: i64, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32, %arg11: i32, %arg12: i64, %arg13: i64, %arg14: i32, %arg15: i32, %arg16: i32, %arg17: i32, %arg18: i32) attributes {llvm.emit_c_interface} {
    %c16 = arith.constant 16 : index
    %c8 = arith.constant 8 : index
    %false = arith.constant false
    %c1 = arith.constant 1 : index
    %c4 = arith.constant 4 : index
    %c0 = arith.constant 0 : index
    %c4_i64 = arith.constant 4 : i64
    %true = arith.constant true
    %c1_i32 = arith.constant 1 : i32
    %c0_i32 = arith.constant 0 : i32
    %cst = arith.constant 0.000000e+00 : f32
    %alloc = memref.alloc() {alignment = 64 : i64} : memref<4x4xf32>
    %alloc_0 = memref.alloc() {alignment = 64 : i64} : memref<1x4xi1>
    %alloc_1 = memref.alloc() {alignment = 64 : i64} : memref<1x4xi1>
    linalg.fill ins(%true : i1) outs(%alloc_1 : memref<1x4xi1>)
    %alloc_2 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi1>
    %alloc_3 = memref.alloc() {alignment = 64 : i64} : memref<4x1xi1>
    linalg.fill ins(%true : i1) outs(%alloc_3 : memref<4x1xi1>)
    scf.for %arg19 = %c0 to %c8 step %c1 {
      %0 = arith.index_cast %arg19 : index to i32
      %1 = arith.extsi %0 : i32 to i64
      %2 = arith.muli %1, %c4_i64 : i64
      %3 = arith.addi %arg12, %2 : i64
      %4 = llvm.inttoptr %3 : i64 to !llvm.ptr
      %view_memref = aux.view %4 to offset: [0], sizes: [1], strides: [1] : !llvm.ptr to memref<1xf32>
